package webexp.a02_variable;

public class A10_RelCalcu {

	public static void main(String[] args) {
		/*
		# 자바의 비교 연산자
		1. 이 연산자들은 마치 클럽 입구를 지키는 보안 요원과 같아요. 이 보안요원은 아주 단순해서, 두 값을 비교하고
			예!!!(true) 또는 아니요!!! (false)이 두 마디만 할 줄 알아요.
		2. 여러분의 코드가 이거 100점 맞아요? 또는 저 사람 성인 맞아요?라고 물어보면, 이 보안요원이 true(네, 맞아요)
			또는 false(아니요, 틀려요)로 대답해 주는 거죠..
		3. 종류
			1) 같거나 다르거나(==, !=)
				== (같다 / Is Equal To) : 이거 두개 완전히 같아요?
				!= (다르다 / Not Equal To) :이거 두 개 서로 달라요?
				동등(Equality), 불일치(Inequality), 결과는 true 아니면 false
				
				왜? = 가  두개 ( == )일까?
				= (한개) : 물건 담는 집게손(대입 연산자)죠.. a = 10; (10을 a에 넣어라!!)
				== (두 개) : 서로 맞대어 보는 거울 (비교 연산자)죠!!  a == 10 ( a랑 10이 같아? )
				
				느낌표(!)는 반대(not)다
				프로그래밍에서 !(느낌표)는 반대(not)라는 뜻입니다.
				!=  ==> not equal 같지 않다.  같지 않을 때, true로 처리..
				
				
				
				
		
		
		*/

	}

}
