package webexp.a01_begin;

public class A01_Hello {

	public static void main(String[] args) {
		// TODO Auto-generated method stub
		// ctrl + s (저장)
		System.out.println("자바 시작!!");
		System.out.println("두번째 출력2!!");
		// f11 : 디버깅으로 실행
		// ctrl + f11 : 실행단축키
		
		

	}

}
/*
# 자바의 세계
1. 자바는 배우기 재미있고 강력한 프로그래밍 언어입니다. 
	1) 90년대 썬 마이크로시스템즈(지금은 오라클)라는 회사에서 만든 프로그래밍 언어입니다.
	2) 자바는 만능 통역사(JVM-java virtural machine)을 가지고 있습니다.
		- 여러분(개발자)이 자바로 안녕하세요라고 코드를 작성하면(한국어), 
			이 코드가 자바 바이트코드(중립 언어-기계어)로 번역됩니다.
		- 이 바이트 코드 파일만 있으면 자바 가상 머신(JVM)이라는 통역사가 설치된 어떤 기계에서든(윈도우, 맥, 리눅스,
			안드로이드폰) 알아서 그 기계에 맞는 언어(기계어)로 통역해 줍니다.
		- 이것이 자바의 가장 유명한 철학인 Write Once, Run Anyhwere(한번 작성하면, 어디서든 실행된다)입니다.
2. 자바의 핵심 특징(키워드)
	- 자바가 왜 이렇게 인기가 많을까요? 바로 이런 강력한 특징(속성) 때문입니다.
	1) 객체지향 프로그래밍(OOP)-가장 중요 : 세상을 사물(객체) 단위로 보고, 이 사물(부품)들을 조립해 하나의 
		완성품(프로그램)을 만드는 방식입니다.
	2) 플랫폼 독립적(JVM) : 위에서 말한 만능 통역사(JVM) 덕분에 윈도우에서 만든 프로그램을 수정 없이 맥이나
		리눅스에도 바로 실행할 수 있습니다.
	3) 자동 메모리 관리(Garbage Collection)
		c언어 같은 경우 개발자가 이 메모 다 썼으니 비워줘라고 직접 청소(관리)해야 했습니다.
		자바는 가비지 컬렉터라는 청소부가 어 이 쓰기기(메모리) 안쓰네! 내가 치워야지 라고 자동으로 메모리를 
		관리해줍니다.
	4) 강력함(Robust) & 보안(Secure) : 메모리를 자동으로 관리하고, 프로그램이 오류로 죽는 상황(포인터 등)
		을 미리 방지하는 문법을 사용해 프로그램이 튼튼하고(Robust) 안정합니다.(secure)
	5) 멀티쓰레드(Multi-threaded) : 프로그램이 하나의 작업(쓰레드)만 하는게 아니라, 동시에 여러 작업(음악 재생
		+ 채팅)을 처리할 수 있게 설계되었습니다.
		
		
		
		
		
		
		
*/



